tests/performance/main.yml
config:
  processor: "./helper.js"
  http:
    timeout: 60000
  target: "https://playground-next.test.aelf.dev"
  phases:
    - duration: 10
      arrivalRate: 5 # Start with 5 requests per second
scenarios:
  - flow:
      - post:
          url: "/playground/test"
          formData:
            contractFiles:
              fromFile: "./Archive.zip"